# 4. Количество символов в элементе массива
#
# Посчитайте количество символов в каждом элементе массива:
#
# [“Ruby”, “Python”, “JavaScript”, “Java”, “.NET”, “HTML”, “Clojure”]
#
# Подсказка:
#
# Используйте метод inject
#
# Результат выведите на экран в виде хэша:
#
# {"Ruby"=>4, "Python"=>6, "JavaScript"=>10, "Java"=>4, ".NET"=>4, "HTML"=>4, "Clojure"=>7, "Go"=>2}
#
# 5. Самая удивительная последовательность
#
# Напишите метод вычисления последовательности Фибоначчи. Попробуйте реализовать алгоритм с помощью цикла и с помощью рекурсии. На следующем занятии мы сравним что работает быстрее.
# 6. Продвинутый шифр Цезаря
#
# Напишите алгоритм rot13, позволяющий кодировать и декодировать текст на английском языке. Например:
#
# cypher = 'Lbh unpxrq n irel frperg zrffntr!'
# rot13(cypher) # => ?
